_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_РаспределениеРаботПоРаботамЗаказчика_НовыйВариант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_РаспределениеРаботПоРаботамЗаказчика_НовыйВариант</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СоответствиеРаботРаботамЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СоответствиеРаботРаботамЗаказчика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РаспределениеСтоимостиРабот</Name>
					<Comment>Рапределение стоимости внутренних работ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаботаВнешняя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПланов</Name>
			<Comment>Статусы планов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыСценариевПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыСценариевПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийРабочий</Name>
					<Comment>Внешний рабочий (для договора с заказчиком)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УтверждениеКалендарногоПланаГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УтверждениеКалендарногоПланаГрафика</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВерсииПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыУтвержденияКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарнаяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СценарииПланированияПроектовСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СценарииПланированияПроектовСтроительства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СМ_ОбъектыСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСценария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзMSProject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзMSProject</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьКритическийПуть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасовКритичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКодаСДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДлительностиЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_РаспределениеРаботПоРаботамЗаказчика_НовыйВариант/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 	

Пункт1=Элементы.Добавить("СписокИсточникКонтекстноеМенюРаспределитьПоРаботамЗаказчика", Тип("КнопкаФормы"), Элементы.СписокИсточник.КонтекстноеМеню);
Пункт1.Заголовок="Распределить по работам заказчика";
Пункт1.ИмяКоманды="КомандаРаспределитьПоРаботамЗаказчика";

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписка(ЗаполнятьТаблицу = Истина)
	
	Если ЗаполнятьТаблицу Тогда
	ЗаполнитьТаблицуСопоставления();
	КонецЕсли;
	
	СценарийПланирования = ДокументУтверждения.КопияСценария;
	СписокИсточник.Отбор.Элементы.Очистить();

	СписокИсточник.Параметры.УстановитьЗначениеПараметра("СценарийПланирования",СценарийПланирования);
	СписокИсточник.Параметры.УстановитьЗначениеПараметра("МассивРабот",ТаблицаСопоставления.Выгрузить().ВыгрузитьКолонку("Работа"));
			
	ЭлементОтбора = СписокИсточник.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = СценарийПланирования;  	
	
	СписокПриемник.Отбор.Элементы.Очистить();
	
	СписокПриемник.Параметры.УстановитьЗначениеПараметра("СценарийПриемник",СценарийПриемник);
		
	ЭлементОтбора = СписокПриемник.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = СценарийПриемник;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаписиРегистра(СценарийПланирования,СценарийПриемник)
	
	 Запрос = Новый Запрос;
	 Запрос.УстановитьПараметр("СценарийПланирования",СценарийПланирования);
	 Запрос.УстановитьПараметр("СценарийПриемник",СценарийПриемник);
	 
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |	УСОERP_СоответствиеРаботРаботамЗаказчика.Работа КАК Работа,
	 |	УСОERP_СоответствиеРаботРаботамЗаказчика.РаботаВнешняя КАК РаботаВнешняя,
	 |	УСОERP_СоответствиеРаботРаботамЗаказчика.РаспределениеСтоимостиРабот КАК РаспределениеСтоимостиРабот,
	 |	УСОERP_СоответствиеРаботРаботамЗаказчика.Работа.СуммарнаяРабота КАК СуммарнаяРабота,
	 |	УСОERP_СоответствиеРаботРаботамЗаказчика.Работа.ПорядокСортировки КАК ПорядокСортировки
	 |ИЗ
	 |	РегистрСведений.УСОERP_СоответствиеРаботРаботамЗаказчика КАК УСОERP_СоответствиеРаботРаботамЗаказчика
	 |ГДЕ
	 |	УСОERP_СоответствиеРаботРаботамЗаказчика.Работа.Владелец = &СценарийПланирования
	 |	И УСОERP_СоответствиеРаботРаботамЗаказчика.РаботаВнешняя.Владелец = &СценарийПриемник
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ПорядокСортировки";
	 
	 Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСопоставления()
	
   	 ТЗ = ПолучитьЗаписиРегистра(ДокументУтверждения.КопияСценария,СценарийПриемник);
	 ЗначениеВРеквизитФормы(ТЗ,"ТаблицаСопоставления");	
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияПриИзменении(Элемент)
	
	УстановитьПараметрыСписка();

КонецПроцедуры

&НаКлиенте
Процедура СценарийПриемникПриИзменении(Элемент)
	
	УстановитьПараметрыСписка();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.КомандаПоказатьНастройки.Пометка = Не ЗначениеЗаполнено(ДокументУтверждения);

	УстановитьПараметрыСписка();
	УстановитьВидимость();
	ОбработатьПереносРаботы();
	УстановитьПараметрыСписка(Ложь);    

КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиРаботу(Команда)
	
	ТекДанные = Элементы.СписокПриемник.ТекущиеДанные;
	Если ТекДанные = Неопределено ИЛИ ТекДанные.СуммарнаяРабота Тогда
		Возврат;
	КонецЕсли;
	
	ТекРабота = Элементы.СписокИсточник.ТекущиеДанные;
	
	Если ТекРабота = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	МассивРабот = Элементы.СписокИсточник.ВыделенныеСтроки;
	
	ПеренестиРаботу(МассивРабот,ТекДанные.Ссылка);
		
	УстановитьПараметрыСписка(Ложь); 
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаКлиенте
Процедура СписокПриемникПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.СписокПриемник.ТекущаяСтрока;
	Элементы.ТаблицаСопоставления.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("РаботаВнешняя,СуммарнаяРабота",ТекСтрока,Ложь));
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленияПослеУдаления(Элемент)
	
	ОбработатьПереносРаботы(Истина);
	УстановитьПараметрыСписка(Ложь);
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ПеренестиРаботу(Работа,РаботаПриемник)
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаСопоставления");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Группа",Работа);
	Запрос.УстановитьПараметр("РаботаВнешняя",РаботаПриемник);
	Запрос.УстановитьПараметр("МассивРабот",ТЗ.ВыгрузитьКолонку("Работа"));
	Запрос.УстановитьПараметр("СценарийПланирования",СценарийПланирования);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК Работа,
	|	УСОERP_СтроительныеРаботы.СуммарнаяРабота КАК СуммарнаяРабота,
	|	&РаботаВнешняя КАК РаботаВнешняя,
	|	100 КАК РаспределениеСтоимостиРабот,
	|	УСОERP_СтроительныеРаботы.ПорядокСортировки КАК ПорядокСортировки
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	УСОERP_СтроительныеРаботы.Ссылка В ИЕРАРХИИ(&Группа)
	|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|	И НЕ УСОERP_СтроительныеРаботы.Ссылка В (&МассивРабот)
	|	И УСОERP_СтроительныеРаботы.Владелец = &СценарийПланирования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ТЗ.Добавить(),Выборка);
		
	КонецЦикла;
	
	ТЗ.Сортировать("ПорядокСортировки");
	
	ЗначениеВРеквизитФормы(ТЗ,"ТаблицаСопоставления");
	
	ОбработатьПереносРаботы();
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьПереносРаботы(Удаление = Ложь) 	
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаСопоставления");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	Запрос.УстановитьПараметр("СценарийПланирования",ДокументУтверждения.КопияСценария);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Работа КАК Работа,
	|	ТЗ.РаботаВнешняя КАК РаботаВнешняя,
	|	ТЗ.РаспределениеСтоимостиРабот КАК РаспределениеСтоимостиРабот,
	|	ТЗ.СуммарнаяРабота КАК СуммарнаяРабота
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВрТаб.Работа ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьВТаблице,
	|	УСОERP_СтроительныеРаботы.КодСДР КАК КодСДР,
	|	УСОERP_СтроительныеРаботы.СуммарнаяРабота КАК СуммарнаяРабота
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВрТаб КАК ВрТаб
	|		ПО УСОERP_СтроительныеРаботы.Ссылка = ВрТаб.Работа
	|ГДЕ
	|	УСОERP_СтроительныеРаботы.Владелец = &СценарийПланирования
	|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_СтроительныеРаботы.НомерРаботыВУровне
	|ИТОГИ
	|	МИНИМУМ(ЕстьВТаблице)
	|ПО
	|	Ссылка ИЕРАРХИЯ";	
	
	ДеревоДанных = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Строки = ДеревоДанных.Строки.НайтиСтроки(Новый Структура("СуммарнаяРабота,ЕстьВТаблице",Истина,Истина),Истина);
	
	Для Каждого НайденнаяСтрока ИЗ Строки Цикл
		
		Нстр = Тз.Добавить();
		Нстр.Работа = НайденнаяСтрока.Ссылка;
		Нстр.СуммарнаяРабота = Истина;
		
	КонецЦикла;   
	
	Если Удаление Тогда
		
		МассивСтрокДляУдаления = Новый Массив;
		
		Строки = ТЗ.НайтиСтроки(Новый Структура("СуммарнаяРабота",Истина));
		
		Для Каждого НайденнаяСтрока ИЗ Строки Цикл
			
			Если ДеревоДанных.Строки.НайтиСтроки(Новый Структура("Ссылка,ЕстьВТаблице",НайденнаяСтрока.Работа,Ложь),Истина).Количество() Тогда
				
				МассивСтрокДляУдаления.Добавить(НайденнаяСтрока);
				
			КонецЕсли;   			
			
		КонецЦикла;
		
		Для Каждого ЭлементМассива ИЗ МассивСтрокДляУдаления Цикл
			
			ТЗ.Удалить(ЭлементМассива);
			
		КонецЦикла;  		
		
	КонецЕсли;  	
	
	ЗначениеВРеквизитФормы(ТЗ,"ТаблицаСопоставления");  	
	
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура СписокИсточникПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	 
КонецПроцедуры  

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	Если НЕ ПроверитьНаПравильность() Тогда
		Возврат;
	КонецЕсли;
	
	КомандаЗаписатьНаСервере();
	Модифицированность = Ложь;
КонецПроцедуры 

&НаСервере
Функция ПроверитьНаПравильность()
	
	Результат = Истина;
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаСопоставления");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗ.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа,
	|	ТЗ.РаботаВнешняя КАК РаботаВнешняя,
	|	ТЗ.РаспределениеСтоимостиРабот КАК РаспределениеСтоимостиРабот
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.Работа КАК Работа,
	|	СУММА(ВрТаб.РаспределениеСтоимостиРабот) КАК РаспределениеСтоимостиРабот
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|ГДЕ
	|	НЕ ВрТаб.Работа.СуммарнаяРабота
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТаб.Работа
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВрТаб.РаспределениеСтоимостиРабот) <> 100";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверное распределение работы "+Выборка.Работа+" ("+Выборка.Работа.КодСДР+"), сумма распределения = "+Выборка.РаспределениеСтоимостиРабот+"%");
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&НаСервере
Процедура КомандаЗаписатьНаСервере()
	
	ТЗ = ПолучитьЗаписиРегистра(ДокументУтверждения.КопияСценария,СценарийПриемник);
	
	Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
		
		МЗ = РегистрыСведений.УСОERP_СоответствиеРаботРаботамЗаказчика.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,СТрокаТЗ);
		МЗ.Удалить();
		
	КонецЦикла; 
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаСопоставления");  	
	
	Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
		
		Если СтрокаТЗ.СуммарнаяРабота Тогда
			Продолжить;
		КонецЕсли;
		
			МЗ = РегистрыСведений.УСОERP_СоответствиеРаботРаботамЗаказчика.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,СТрокаТЗ);
		МЗ.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриемникПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокИсточникПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоПредыдущемуСценарию(Команда)
	
	ПараметрыОтбора = Новый Структура("ОбъектСтроительства,Проведен,Статус",ОбъектСтроительства,Истина,ПредопределенноеЗначение("Перечисление.СтатусыПланов.Утвержден"));
	ПараметрыВыбора = Новый Структура("Отбор",ПараметрыОтбора);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоСценариюПродолжение",ЭтотОбъект);
	
	ОткрытьФорму("Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.Форма.ФормаВыбора",ПараметрыВыбора,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	   
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСценариюПродолжение(ВыбранноеЗначение,ДопПараметры)Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура("ДокументУтверждения",ВыбранноеЗначение);
	
	Если ТаблицаСопоставления.Количество() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоСценариюОкончание",ЭтотОбъект,ПараметрыЗаполнения);		
		ПоказатьВопрос(ОписаниеОповещения,"Текущие данные будут очищены, продолжить?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьПоСценариюОкончание(КодВозвратаДиалога.Да,ПараметрыЗаполнения);
		
	КонецЕсли;   	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСценариюОкончание(Ответ,ДопПараметры)Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоСценариюНаСервере(ДопПараметры.ДокументУтверждения);
	Модифицированность = Истина;
		
КонецПроцедуры

&НаСервере
Процедура   ЗаполнитьПоСценариюНаСервере(ТекДокумент)
	
	  ТекСценарий = ТекДокумент.КопияСценария;
	  
	  Запрос = Новый Запрос;
	  Запрос.УстановитьПараметр("ТекСценарий",ТекСценарий);
	  Запрос.УстановитьПараметр("СценарийПланирования",СценарийПланирования);
	  Запрос.УстановитьПараметр("СценарийПриемник",СценарийПриемник);
	  Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	УСОERP_СтроительныеРаботы.Ссылка КАК Работа,
	  |	УСОERP_СтроительныеРаботы.ПорядокСортировки КАК ПорядокСортировки,
	  |	УСОERP_СоответствиеРаботРаботамЗаказчика.РаботаВнешняя КАК РаботаВнешняя,
	  |	УСОERP_СоответствиеРаботРаботамЗаказчика.РаспределениеСтоимостиРабот КАК РаспределениеСтоимостиРабот,
	  |	УСОERP_СтроительныеРаботы.СуммарнаяРабота КАК СуммарнаяРабота
	  |ИЗ
	  |	РегистрСведений.УСОERP_СоответствиеРаботРаботамЗаказчика КАК УСОERP_СоответствиеРаботРаботамЗаказчика
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	  |		ПО УСОERP_СоответствиеРаботРаботамЗаказчика.Работа.РаботаИсточник = УСОERP_СтроительныеРаботы.РаботаИсточник
	  |ГДЕ
	  |	УСОERP_СоответствиеРаботРаботамЗаказчика.Работа.Владелец = &ТекСценарий
	  |	И УСОERP_СоответствиеРаботРаботамЗаказчика.РаботаВнешняя.Владелец = &СценарийПриемник
	  |	И УСОERP_СтроительныеРаботы.Владелец = &СценарийПланирования
	  |	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	  |	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
	  |
	  |УПОРЯДОЧИТЬ ПО
	  |	УСОERP_СтроительныеРаботы.ПорядокСортировки";
	  
	  ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(),"ТаблицаСопоставления");
	  ОбработатьПереносРаботы();
	  УстановитьПараметрыСписка(Ложь);  
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ПоказатьНастройки = Элементы.КомандаПоказатьНастройки.Пометка;
	Элементы.Организация.Видимость = ПоказатьНастройки;
	Элементы.ГруппаДокументУтверждения.Видимость = ПоказатьНастройки;
	Элементы.ОрганизацияПриемник.Видимость = ПоказатьНастройки;
	Элементы.ГруппаСценарийПриемник.Видимость = ПоказатьНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьНастройки(Команда)
	
	Элементы.КомандаПоказатьНастройки.Пометка = НЕ Элементы.КомандаПоказатьНастройки.Пометка;
	УстановитьВидимость();
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаЗаполнитьПоПредыдущемуСценариюЗаказчика(Команда)
	
	ПараметрыОтбора = Новый Структура("Владелец,ВидСценария",ОбъектСтроительства,ПредопределенноеЗначение("Перечисление.УСОERP_ВидыСценариевПланирования.ВнешнийРабочий"));
	ПараметрыВыбора = Новый Структура("Отбор,ОтборВерсийДляОтчета",ПараметрыОтбора,Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоСценариюЗаказчикаПродолжение",ЭтотОбъект);
	
	ОткрытьФорму("Справочник.УСОERP_СценарииПланированияПроектовСтроительства.Форма.ФормаВыбораВерсий",ПараметрыВыбора,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПоСценариюЗаказчикаПродолжение(ВыбранноеЗначение,ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура("СценарийЗаказчика",ВыбранноеЗначение);
	
	Если ТаблицаСопоставления.Количество() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоСценариюЗаказчикаОкончание",ЭтотОбъект,ПараметрыЗаполнения);
		ПоказатьВопрос(ОписаниеОповещения,"Текущие данные будут очищены, продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПоСценариюЗаказчикаОкончание(КодВозвратаДиалога.Да,ПараметрыЗаполнения);
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСценариюЗаказчикаОкончание(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПоСценариюЗаказчикаНаСервере(ДопПараметры);	
	Модифицированность = Истина;		
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоСценариюЗаказчикаНаСервере(ДопПараметры)
	
	Запрос= Новый Запрос;
	
	Запрос.УстановитьПараметр("СценарийЗаказчика",ДопПараметры.СценарийЗаказчика);
	Запрос.УстановитьПараметр("СценарийПланирования",ДокументУтверждения.КопияСценария);
	Запрос.УстановитьПараметр("ТекСценарий",СценарийПриемник);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_СоответствиеРаботРаботамЗаказчика.Работа КАК Работа,
	|	УСОERP_СтроительныеРаботы.Ссылка КАК РаботаВнешняя,
	|	УСОERP_СоответствиеРаботРаботамЗаказчика.РаспределениеСтоимостиРабот КАК РаспределениеСтоимостиРабот,
	|	УСОERP_СоответствиеРаботРаботамЗаказчика.Работа.ПорядокСортировки КАК ПорядокСортировки,
	|	УСОERP_СоответствиеРаботРаботамЗаказчика.Работа.СуммарнаяРабота КАК СуммарнаяРабота
	|ИЗ
	|	РегистрСведений.УСОERP_СоответствиеРаботРаботамЗаказчика КАК УСОERP_СоответствиеРаботРаботамЗаказчика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|		ПО УСОERP_СоответствиеРаботРаботамЗаказчика.РаботаВнешняя.РаботаИсточник = УСОERP_СтроительныеРаботы.РаботаИсточник
	|ГДЕ
	|	УСОERP_СоответствиеРаботРаботамЗаказчика.РаботаВнешняя.Владелец = &СценарийЗаказчика
	|	И УСОERP_СоответствиеРаботРаботамЗаказчика.Работа.Владелец = &СценарийПланирования
	|	И УСОERP_СтроительныеРаботы.Владелец = &ТекСценарий
	|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_СоответствиеРаботРаботамЗаказчика.Работа.ПорядокСортировки";
	
	  ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(),"ТаблицаСопоставления");
	  ОбработатьПереносРаботы();
	  УстановитьПараметрыСписка(Ложь); 
	  
КонецПроцедуры 

&НаКлиенте
Процедура КомандаРаспределитьПоРаботамЗаказчика(Команда)
	
	ТекСтрока = Элементы.СписокИсточник.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено ИЛИ ТекСтрока.СуммарнаяРабота= Истина Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Работа,СценарийЗаказчика",ТекСтрока.Ссылка,СценарийПриемник);
	ОписаниеОповещения = Новый ОписаниеОповещения("РаспределитьПоРаботамПродолжение",ЭтотОбъект);
	
	ОткрытьФорму("Обработка.УСОERP_РаспределениеРаботПоРаботамЗаказчика_НовыйВариант.Форма.ФормаРаспределения",СтруктураПараметров,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоРаботамПродолжение(Результат,ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = Элементы.СписокИсточник.ТекущиеДанные;
	
	Для Каждого СтрокаТЗ ИЗ Результат Цикл
		
		Нстр = ТаблицаСопоставления.Добавить();
		Нстр.Работа = ТекСтрока.Ссылка;
		Нстр.ПорядокСортировки = ТекСтрока.ПорядокСортировки;
		ЗаполнитьЗначенияСвойств(Нстр,СтрокаТЗ);  		
		
	КонецЦикла;
	
	ОбработатьПереносРаботы();
	
	УстановитьПараметрыСписка(Ложь);
	ТаблицаСопоставления.Сортировать("ПорядокСортировки");
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда
		
		Если Модифицированность Тогда
			
			СтандартнаяОбработка = Ложь;
			Отказ = Истина;
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемПродолжение",ЭтотОбъект);
			
			ПоказатьВопрос(ОписаниеОповещения,"Данные были изменены, сохранить изменения?",РежимДиалогаВопрос.ДаНетОтмена);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Закрыть();
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		КомандаЗаписать(Истина);
		Закрыть();
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленияОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокИсточникОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокПриемник.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено И НЕ ТекСтрока.СуммарнаяРабота Тогда
		
		КомандаПеренестиРаботу(Истина);
		
	КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры
